#include <stdio.h>
#include <locale.h>

int main (void)
{
    setlocale(LC_ALL, "ru_RU.UTF-8");
	int a = 12345678;
    int b = 1000000;
    printf("1 задание: Перевод из 10 в 16 систему счисления чисел a = 12345678_10 и b = 1000000_10\n");
    printf("\ta_10 = %d\n", a);  // в Десятичной системе
    printf("\ta_16 = %X\n", a);  // в Шестнадцатеричной системе
    printf("\tb_10 = %d\n", b);  // в Десятичной системе
    printf("\tb_16 = %X\n", b);  // в Шестнадцатеричной системе
    int a1 = 0x12345678;
    int b1 = 0x1000000;
    //--------------------------------------------------------------------------------
    printf("\n2 задание: Перевод из 16 в 10 систему счисления чисел a = 12345678_16 и b = 1000000_16\n");
    printf("\ta_16 = %X\n", a1);  // в Шестнадцатеричной системе
    printf("\ta_10 = %d\n", a1);  // в Десятичной системе
    printf("\tb_16 = %X\n", b1);  // в Шестнадцатеричной системе
    printf("\tb_10 = %d\n", b1);  // в Десятичной системе
    //--------------------------------------------------------------------------------
    printf("\n3 задание: Составить логическое выражение\n");
    printf("\tСтакан молока - А\n");
    printf("\tМед - В\n");
    printf("\tБез хлеба - С\n");
    printf("\tЛогическое выражение Х = А && B && C\n");
    //--------------------------------------------------------------------------------
    printf("\n4 задание: Доказать тождества 1) А->B=!A||B, 2) А<->B=(A&&B)||(!A&&!B) \n");
    printf("\t1) А->B=!A||B\n");
    printf("\tA B | А->B = !A B | !A||B\n");  
    printf("\t-----------------------------\n");
    for (int a = 0; a <= 1; a++) 
    {
        for (int b = 0; b <= 1; b++) 
        {
            int result = (!a | b);
            printf("\t%d %d |  %d   =  %d %d |  %d\n", a, b, result, !a, b, result);
           
        }
    }
    printf("\n\t2) А<->B=(A&&B)||(!A&&!B)\n");
    printf("\tA B | A&&B  !A !B | !A&&!B  A&&B !A&&!B | (A&&B)||(!A&&!B) = A<->B\n");  
    printf("\t------------------------------------------------------------------\n");
    for (int a = 0; a <= 1; a++) 
    {
        for (int b = 0; b <= 1; b++) 
        {
            int result = (a&b);
            int result1 = (!a&!b);
            int result2 = (result|result1);
            printf("\t%d %d |  %d     %d  %d |   %d       %d     %d   |        %d         =   %d\n", a, b, result, !a, !b, result1, result, result1, result2, result2);
           
        }
    }
    //--------------------------------------------------------------------------------
    printf("\n5 задание: Найти эквивалент для XOR\n");
    printf("\tA XOR B =(!A&&B)||(A&&!B)\n"); 
    printf("\t!A B | !A&&B  A !B | A&&!B  !A&&B A&&!B | (!A&&B)||(A&&!B) = A XOR B\n");   
    printf("\t--------------------------------------------------------------------\n");
    for (int a = 0; a <= 1; a++) 
    {
        for (int b = 0; b <= 1; b++) 
        {
            int result = (!a&b);
            int result1 = (a&!b);
            int result2 = (result|result1);
            printf("\t %d %d |  %d     %d  %d |   %d       %d    %d   |        %d         =   %d\n", !a, b, result, a, !b, result1, result, result1, result2, result2);
           
        }
    }
    //--------------------------------------------------------------------------------
    printf("\n6 задание: Упростить выражение Х = (B -> A)!(A + B)(A -> C)\n");
    printf("\t1)Согласно законам алгебры логики раскрываем скобки, получаем (!B + A)(!A & !B)(!A + C)\n");
    printf("\t2)Преобразуем вторые скобки, получаем                         (!B + A)& !A & !B &(!A + C)\n");
    printf("\t3)Умножаем на первые скобки, получаем                         (!A & !B & !B + !A & !B & A)(!A + C)\n");
    printf("\t4)Сокращаем выражение, получаем                               (!A & !B + 0)(!A + C)\n");
    printf("\t5)Сокращаем выражение, получаем                               (!A & !B)(!A + C)\n");
    printf("\t6)Раскрываем все скобки, получаем                             !A & !B & !A + !A & !B & C)\n");
    printf("\t7)Сокращаем выражение, получаем                               !A & !B + !A & !B & C)\n");
    printf("\t8)Выносим за скобки общий множитель, получаем                 !A & !B (1 + C)\n");
    printf("\t9)Сокращаем выражение, получаем ответ                         !A & !B\n");
    return 0;
}